{"id":1840,"date":"2019-02-25T09:35:13","date_gmt":"2019-02-25T09:35:13","guid":{"rendered":"https:\/\/www.omnigeometry.com\/?p=1840"},"modified":"2019-02-26T09:51:37","modified_gmt":"2019-02-26T09:51:37","slug":"version-1-3","status":"publish","type":"post","link":"https:\/\/www.omnigeometry.com\/version-1-3\/","title":{"rendered":"Version 1.3"},"content":{"rendered":"<p>This release improves almost all areas of OmniGeometry including usability, drawing performance, stability and bringing a slew of new features like:<\/p>\n<ul>\n<li>Big performance optimizations to drawing.<\/li>\n<li><strong>One way scaling<\/strong> mode and <strong>scale fading<\/strong>.<\/li>\n<li><strong>Improved line weighting<\/strong> for drawing more beautiful patterns by default.<\/li>\n<li><strong>Fullscreen projection mode<\/strong>.<\/li>\n<li><strong>Layer selection<\/strong> with mouse &amp; <strong>selection rectangle<\/strong>.<\/li>\n<li><strong>Storing the tracing<\/strong> to a background layer to help build more beautiful trace patterns.<\/li>\n<li>Changes on how modify all works.<\/li>\n<li><strong>Restoring and storing of animation parameters<\/strong> to enable returning to a good animation state.<\/li>\n<li><strong>Proper color filling of layers.<\/strong><\/li>\n<li>And last but not definitely least: <strong>Undo\/Redo support.<\/strong><\/li>\n<\/ul>\n<div class=\"video-plugin-new embed\" style=\"max-width:100%; width:560px; height:auto; padding-top:0; padding-bottom:0; margin:0 auto;margin:0 auto; border: 0px solid #fff;margin-bottom: 20px;\"><div style=\"width:560px;height:0;  padding-bottom: 56.25%; padding-top:0;\"><iframe src=\"https:\/\/player.vimeo.com\/video\/319572784\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"><\/iframe><\/div><\/div>\n<h3>Undo\/Redo support<\/h3>\n<p>Undo and redo makes it much easier for you to return to any step in your scene, and experiment without having to save your scene at each point.<\/p>\n<p>There are still some areas of the undo\/redo feature that we are tweaking, some edge cases where the undo state might not work as expected, but we want to release this as it provides great benefits already.<\/p>\n<h3>Improved drawing performance<\/h3>\n<p>Drawing performance has been greatly optimized, making especially animating much smoother. Line weights are now by default adjusted based on the recursion level, producing more beautiful patterns by default.<\/p>\n<h3>One way scaling &amp; scale fading<\/h3>\n<p>The animation scaling now has two modes: sinusoidal (back and forth) and saw wave (one way). Scaling can now also be combined with the fading in and out effect, allowing the layers to be faded in or out as they are reaching the end of the scale phases. This can create some very beautiful tunnel like effects when combined with the saw wave scaling mode especially.<\/p>\n<h3>Projection mode<\/h3>\n<p>Projection mode makes it easy to enter into fullscreen mode with no UI elements visible, making ideal for VJing or just admiring your scene without any distractions. Pressing ctrl+alt+U will toggle the projection mode in fullscreen. Pressing ctrl+U (toggle UI) in projection mode will gradually return back towards full UI visibility.<\/p>\n<h3>Line weight modes<\/h3>\n<p>Line weight now has three distinct modes, which affect how the line weights are adjusted over levels of layer recursion.<\/p>\n<ul>\n<li><em>&#8220;Recursive&#8221;<\/em> means that the layers line weights are adjusted based on the recursion level.<\/li>\n<li><em>&#8220;Animation scaled recursive&#8221;<\/em> adjusts the line weights based on the current animation scaling value.<\/li>\n<li><em>&#8220;Fixed&#8221;<\/em> always keeps the line weight at it&#8217;s set value, keeping line weight static between recursion levels.<\/li>\n<li>The <em>&#8220;Animation scaled recursive&#8221;<\/em> is same as in version 1.2, providing backwards compatibility with existing scenes.<\/li>\n<\/ul>\n<h3>Tracing store<\/h3>\n<p>You can now store the current tracing into the tracing store with comma (,). This acts like another background layer, where the contents of the tracing are copied and the current tracing cleared. This way you can easily find a good looking trace and continue building on top of that easier. The stored tracing can be cleared with (alt+,).<\/p>\n<h3>Improved fill layer functionality<\/h3>\n<p>The filling of layers now fills the whole layer consistently, instead of filling separate parts of the layers and resulting in overdraw. This actually makes the fill functionality usable with recursion.<\/p>\n<h3>Layer selection with mouse &amp; selection rectangle<\/h3>\n<p>Layers can now be selected by clicking on them in the canvas. Shift + clicking selects\/deselects multiple layers.<\/p>\n<p>We&#8217;ve also added a new mouse mode, the layer selection mode, where you can select multiple layers from the secene with a traditional selection rectangle.<\/p>\n<h3>Changes on how modify all works<\/h3>\n<p>Pressing space bar now toggles Select All layers. Previously it toggled modify all.<\/p>\n<p>Select all will only keep selected those layers you originally had in the scene when toggling it, and not select new layers when copying. This behaves like modify all before, selecting and unselecting all layers when toggled.<\/p>\n<p>Modify all is now toggled with shift+space, and will always modify all of the layers, not taking into account copying of layers.<\/p>\n<p>You can also now invert the current layer selection with shift+control, making it easier to switch modifying between two sets of layers for example.<\/p>\n<h3>Removed features &amp; backwards compatibility notes<\/h3>\n<p>This version brings also some possibly scene breaking fixes and feature removals.<\/p>\n<p>The <strong>vertical and horizontal ratio parameters have been removed<\/strong> as they didn&#8217;t really bring much benefit in the philosophical sense of what OmniGeometry is doing. We might be looking in the future how to achieve the same effect from another angle.<\/p>\n<p><strong>We also evaluated the MIDI support to not to be so usable state yet, so for now it has been removed<\/strong>. We are thinking about implementing this in a more proper way in the future.<\/p>\n<p>The previous version also had a bug in the way star and curve values were calculated with recursion, that has been fixed and will affect existing scenes using star and curves with recursion, so you might have to adjust existing scenes to find the same visual representation.<\/p>\n<h2>Complete list of changes<\/h2>\n<h4><strong>New features<\/strong><\/h4>\n<ul>\n<li>Undo\/Redo support. Still slightly experimental, but fully usable in most cases.<\/li>\n<li>One way scaling support to create amazing, hypnotizing zooming and tunneling animations, good to use with trace as well.<\/li>\n<li>Smooth fade-in &#8211; fade-out to scaling animation, to create soothing zooming and tunneling animations.<\/li>\n<li>Projection mode for working with scenes without any user interface. All controls are still available via keyboard shortcuts and mouse. Great for doing VJ work live or simply being fully immersed in the space.<\/li>\n<li>Storing of tracing into tracing store.<\/li>\n<li>Selecting of layers by clicking on the layers on the canvas.<\/li>\n<li>Layer selection rectangle, allowing easy selection of multiple layers<strong>.<\/strong><\/li>\n<\/ul>\n<h4><strong>Usability improvements<\/strong><\/h4>\n<ul>\n<li>Major performance improvements in drawing, resulting in smoother and faster operation.<\/li>\n<li>Now it&#8217;s possible to drag an OmniGeometry scene file directly on the canvas to load.<\/li>\n<li>Modify all moved to shift+space, (un)select all layers is now in space.<\/li>\n<li>Invert layer selection is now at shift+ctrl.<\/li>\n<li>Active layer and selected layers information is now saved to scene and will come up when loading.<\/li>\n<li>Canvas size now only accepts positive values over 32.<\/li>\n<li>Keyboard shortcuts Q and W now change child radius value linearly, allowing more precise control of child radius values, and calculates the child radius ratio based on the child radius. The child radius ratio can still be set directly also from the UI.<\/li>\n<li>Showing of confirmation dialog when loading or creating a new scene, if the current scene was modified and not saved.<\/li>\n<li>Displaying parameter names instead of numerical values when changing toggle parameters.<\/li>\n<li>Fine tuning of many parameter sliders.<\/li>\n<li>Updated mouse toolbar icons to be more sharp, changed radius and angle offset parameter icons.<\/li>\n<li>Limiting of parameter input values to prevent invalid values to be entered.<\/li>\n<li>Keyboard shortcut for maximizing workspace (ctrl+alt+F).<\/li>\n<li>Show warning message when trying to copy multiple layers at vertex points.<\/li>\n<li>Reset vertex point shortcut changed to (ctrl+.)<\/li>\n<li>Updates to help file.<\/li>\n<\/ul>\n<h4><strong>Animation<\/strong><\/h4>\n<ul>\n<li>Storing, restoring and resetting of animation parameter values manually, enabling<br \/>\neasy return to a good initial set of animation parameters, or resetting back to the default values.<\/li>\n<li>Shortcuts for inverting scale, rotation and animation hue rotation parameter values.<\/li>\n<li>Animation parameters now have modifiers for multiplying and dividing the values with a dropdown of presets.<\/li>\n<li>UI button for swapping scale start and end values.<\/li>\n<\/ul>\n<h4><strong>Drawing<\/strong><\/h4>\n<ul>\n<li>De-coupled automatic enabling of star and curve draw features with their radius adjustment keys (alt+)YU.  This is to promote a more straight forward and conscious operation of the state. Now you need to specifically enable those draw features (alt+)G.<\/li>\n<li>When re-sizing the canvas, all layers will keep their position relative to the center of the canvas, no longer requiring  separately centering elements.<\/li>\n<li>Added three line weight modes: Recursive when animation scaled, Recursive always, Fixed.  These affect the way line weights are adjusted on different recursion levels of a layer.<\/li>\n<li>Fill points and draw points can now be toggled separately.<\/li>\n<li>Improved layer fill functionality, filling a layer with recursion the way you expect it to be filled.<\/li>\n<li>Optimized the layer selection overlay drawing.<\/li>\n<\/ul>\n<h4><strong>Exporting<\/strong><\/h4>\n<ul>\n<li>Fixed exporting of PDFs from scenes which had special characters like &#8216;\/&#8217; in their names.<\/li>\n<li>Tracing does not anymore lock the resolution PNG images can be exported with.<br \/>\nThe tracing is now scaled to the set export resolution.<\/li>\n<\/ul>\n<h4><strong>Bugfixes<\/strong><\/h4>\n<ul>\n<li>Fixed bug in recursive star and curve rendering.<\/li>\n<li>Fixed bug in scene loader when scrolling to the very bottom of the scene pages, resulting in jerky movement and displaying of the wrong page number.<\/li>\n<li>The progress bar for loading scenes sometimes stuck near the end, now it always completes.<\/li>\n<li>Parameter dropdowns are now updated when changing active layer.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>This release improves almost all areas of OmniGeometry including usability, drawing performance, stability and bringing a slew of new features like: Big performance optimizations to drawing. One way scaling mode and scale fading. Improved line weighting for drawing more beautiful patterns by default. Fullscreen projection mode. Layer selection with mouse &amp; selection rectangle. Storing the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1826,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[],"_links":{"self":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts\/1840"}],"collection":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/comments?post=1840"}],"version-history":[{"count":1,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts\/1840\/revisions"}],"predecessor-version":[{"id":1841,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts\/1840\/revisions\/1841"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/media\/1826"}],"wp:attachment":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/media?parent=1840"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/categories?post=1840"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/tags?post=1840"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}