{"id":1884,"date":"2019-05-19T19:15:13","date_gmt":"2019-05-19T19:15:13","guid":{"rendered":"https:\/\/www.omnigeometry.com\/?p=1884"},"modified":"2019-05-19T19:15:13","modified_gmt":"2019-05-19T19:15:13","slug":"development-update-downloadable-version","status":"publish","type":"post","link":"https:\/\/www.omnigeometry.com\/development-update-downloadable-version\/","title":{"rendered":"Development Update: Downloadable version"},"content":{"rendered":"<p>Hey, it&#8217;s Sakari, lead developer of OmniGeometry here. Here to give you an idea of what we are currently working on at OmniGeometry.<\/p>\n<p>We have three main features coming down our development pipeline:<\/p>\n<ol>\n<li>Bug fixes and requested features for OmniGeometry 1.3, to fix the remaining bugs and introduce features requested by users.<\/li>\n<li>Standalone, downloadable version of OmniGeometry.<\/li>\n<li>Independent library for embedding animated OmniGeometry scenes into a website, or standalone application for playing back OmniGeometry scenes.<\/li>\n<\/ol>\n<p>In this post, I will describe the first part and our progression on that. I will go more into detail on the other parts in upcoming posts.<\/p>\n<h3>Standalone, downloadable version<\/h3>\n<p>This has been the most requested thing by our users, and we are committed to delivering it hopefully during this year.<\/p>\n<p>On more technical detail, we have prototyped many different ways to implement this, even going as far as starting to implement a native desktop -application implemented with C++ and OpenGL, and testing out many different methods on how this would be best implemented, but ultimately we have come to the realization that web technologies are advancing fast, and that we are already approaching close to native application speeds in our use case.<\/p>\n<p>Our work on OmniGeometry 1.3 has proven that we can provide almost near to native code performance, or about 80% of that at least with our current javascript -based codebase. We are also seeing the rise of WebAssembly, and have also experimented with these technologies in order to bring more closer to native speeds in the future hopefully.<\/p>\n<figure id=\"attachment_1885\" aria-describedby=\"caption-attachment-1885\" style=\"width: 1024px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-large wp-image-1885\" src=\"https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32-1024x640.png\" alt=\"OmniGeometry standalone first test version\" width=\"1024\" height=\"640\" srcset=\"https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32-1024x640.png 1024w, https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32-300x188.png 300w, https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32-768x480.png 768w, https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32-1536x960.png 1536w, https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32-595xh.png 595w, https:\/\/www.omnigeometry.com\/wp-content\/uploads\/2019\/05\/Screenshot-2019-04-22-at-16.16.32.png 1680w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-1885\" class=\"wp-caption-text\">OmniGeometry standalone first test version.<\/figcaption><\/figure>\n<p>Here you can see the very first version of our standalone application. We will be implementing this using Electron, allowing us to take the current version and package it as a downloadable version.<\/p>\n<p>The downloadable version is our priority right now, and we are aiming for release of the standalone version during 2019.<\/p>\n<p>But we are also going to continue developing 1.3.x, to fix the remaining bugs and introduce highly needed features like finally implementing proper recursion depth calculation that does not stall or freeze the browser when working with highly complex scenes, or providing easier way to export sequences of animation frames so you can create movies of your scenes.<\/p>\n<h3>Thank you for your support!<\/h3>\n<p>Happy to hear so many users loving using our software. We also thank you for your patience, we are listening to feedback and reacting to it, but with our team of three these things take some time to implement 🙂<\/p>\n<p>We have pretty limited resources currently (I am working a dayjob 4 days a week and our other developer is currently taking a hiatus, hopefully getting soon back to OmniGeometry!), but we are committed to deliver a standalone, downloadable version of OmniGeometry that can run on Windows, Mac and Linux platforms.<\/p>\n<h3>We are here for the long run<\/h3>\n<p>We have long term plans to create the best sacred geometry creation software this planet has seen, and in a way we have only scratched the surface of what we are planning for the future!<\/p>\n<p>We are committed to spread first hand experience of the power of sacred geometry to the people, and hopefully will be able to make a real change in the way we look at things, how we construct things, how we build things and how we could utilize sacred geometry in everything we create! This is part of my dream and mission here, to share this knowledge, to bring first hand experience of how sacred geometry can benefit us in all areas of our life.<\/p>\n<p>This was Sakari, Lead Developer of OmniGeometry, signing out!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hey, it&#8217;s Sakari, lead developer of OmniGeometry here. Here to give you an idea of what we are currently working on at OmniGeometry. We have three main features coming down our development pipeline: Bug fixes and requested features for OmniGeometry 1.3, to fix the remaining bugs and introduce features requested by users. Standalone, downloadable version [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1890,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[21,20,19],"_links":{"self":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts\/1884"}],"collection":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/comments?post=1884"}],"version-history":[{"count":4,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts\/1884\/revisions"}],"predecessor-version":[{"id":1892,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/posts\/1884\/revisions\/1892"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/media\/1890"}],"wp:attachment":[{"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/media?parent=1884"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/categories?post=1884"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.omnigeometry.com\/wp-json\/wp\/v2\/tags?post=1884"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}